wintersmith/contents/articles/Compute/2014-10-14-concurrency-support-LL-SC.html
---
date: 2014-10-14 20:36:02
template: tech.jade
title: Concurrency support - LL/SC
category: Compute
chage_frequency: monthly
tag: cs,concurrency
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">LL/SC</a>
<ul>
<li><a href="#sec-1-1">vs CAS</a></li>
<li><a href="#sec-1-2">Implementation</a></li>
</ul>
</li>
<li><a href="#sec-2">refrence</a></li>
</ul>
</div>
</div>
<p>
本文介绍CPU/硬件对并发的支持之LL/SC (Load-Link/Store-Conditional).
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">LL/SC</h2>
<div class="outline-text-2" id="text-1">
<p>
LL/SC 可以实现Lock-Free的同步原语。它对并发同步的解决方式是通过Read-Modify-Write的方式完成。
其中，在Write的时候，做Condition Check，确保数据在Read之后没有发生过更新。
</p>
<blockquote>
<p>
Load-link returns the current value of a memory location, while a subsequent store-conditional to the same memory location will store a new value only if no updates have occurred to that location since the load-link. Together, this implements a lock-free atomic read-modify-write 
</p>
</blockquote>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">vs CAS</h3>
<div class="outline-text-3" id="text-1-1">
<p>
与CAS(compare-and-swap)机制相比，LL/SC有更强的同步正确性保障，只要有LL后的任何update，都会使后续的SC操作失败。而CAS某些情况下得ABA问题。
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Implementation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Alpha、PowerPC、MIPS、ARM实现了LL/SC指令，LL和SC为两个指令，构成Instruction pair。
</p>

<p>
实现方式：track cache-line access
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">refrence</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://en.wikipedia.org/wiki/Load-link/store-conditional">Load-link/Store-conditional</a>
</li>
</ul>
</div>
</div>
